algorythmics/pianoplayer/firmware/escherOS-rhea/libs/escher/HWP_dsPIC33E_SK_ENC624.h
/*********************************************************************
 *
 *   Hardware specific definitions for:
 *    - dsPIC33E USB Starter Kit
 *    - PIC24E, dsPIC33E
 *    - Fast 100Mbps Ethernet PICtail Plus (ENC624J600)
 *    - parallelboard uses PMP mode 5 (not indexed)
 *
 *********************************************************************
 * FileName:        HWP_dsPIC33E_SK_ENC624.h
 * Dependencies:    Compiler.h
 * Processor:       PIC24E, dsPIC33E
 * Compiler:        Microchip C30 v3.30 or higher
 * Company      : Algorythmics
 *
 *  * License: GPL V3.0
 *
 *  Derived from MicroChip TCP/IP-Stack used for Escher Hardware
 * 
 * This module defines the escher hardware specific parts for various
 * boards like escher1 and Evaluation boards
 * and also helper to startup escher boards.
 *
 * Ports are the Interfaces of the escher hardware like described
 * in the manual trying to keep up with versions of the board.
 *
 *
 * Author              Date         Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Howard Schlunder      09/16/2010   Regenerated for specific boards
 * Winfried Ritsch     12.5.2012    diversion to dsPIC33E Startkit w PUCTAIL 100MB
 *  ********************************************************************/
#ifndef HARDWARE_PROFILE_dsPIC33E_SK_ENC624_H
#define HARDWARE_PROFILE_dsPIC33E_SK_ENC624_H

#include "Compiler.h"

// Define a macro describing this hardware set up (used in other files)
#define dsPIC33E_SK
#define ESCHER_HW_dsPIC33E_SK
#define ESCHER_ENC624      // we use the enc624
#define ESCHER_ENC624_PSP5 // for parallel board specific defines (should be avoided)

#if  defined(ESCHER2_DEFAULT_CLOCK_SETTINGS) && defined(THIS_IS_MAIN)
// All dsPIC33E and PIC24E PIMs
_FOSCSEL(FNOSC_PRIPLL) // Primary PLL enabled
_FOSC(OSCIOFNC_OFF & POSCMD_XT) // XT Osc
#endif

#if  defined(ESCHER2_DEFAULT_CLOCK_SETTINGS)

/* OSCILLATOR Frequency setting from Demo Application:
 * Multiply by 40 for 160MHz VCO output (8MHz XT oscillator)
 * FRC: divide by 2, PLLPOST: divide by 2, PLLPRE: divide by 2
 *
 * F_OSC= F_IN * (PLLDIV+2) / ( (PLLPRE+2) * 2*(PLLPOST+1) )
 *
 * 8Mhz * (38+2) / (0+2)*2*(0+1) = 80Mhz
 */
#define ESCHER_PLLPOST 0b00
#define ESCHER_PLLPRE 0b00
#define ESCHER_PLLFBD  43 // Same as PLLDIV=M-2
//#define ESCHER_PLLFBD  38 // Same as PLLDIV=M-2 (default for stack)

#define ESCHER_OSCCONH 0x03 // FRC with PLL (NOSC=0b001)
#define ESCHER_OSCCONL 0b001 // as last 3 bits
#define ESCHER_OSCCONH_COSC 0b11
#define ESCHER_SWDTEN 0 // watchdogg disable
#define ESCHER_OSCTUN 0


#define OSC_FCY      (90316800ul)

#define BCG_VAL  1 // DSI not so fast Mode

        //#define OSC_FCY      (80000000ul)
#endif

// Clock frequency values
// These directly influence timed events using the Tick module.  They also are used for UART and SPI baud rate generation.
#if ! defined(GetSystemClock)
#define GetSystemClock()      (OSC_FCY) // Hz
#endif

#if defined (__dsPIC33E__)
/* InstructionClock Normally GetSystemClock()/2 for PIC24/dsPIC
 * Might need changing if using Doze modes. */
#define GetInstructionClock()   (GetSystemClock()/2)
#define GetPeripheralClock()   (GetSystemClock()/2)
#endif


// Hardware I/O pin mappings
// ----------------- On Board Hardware Definitions -----------------
// On Board LEDs (SAME as IC out on Port 1 !!!!)

#define OB_LED_ON 1
#define OB_LED_OFF 0

#define   OB_LED0_TRIS   (TRISDbits.TRISD0)
#define OB_LED0      (LATDbits.LATD0)
#define   OB_LED1_TRIS   (TRISDbits.TRISD1)
#define OB_LED1      (LATDbits.LATD1)
#define   OB_LED2_TRIS   (TRISDbits.TRISD2)
#define OB_LED2      (LATDbits.LATD2)
#define   OB_LED3_TRIS   (OB_LED0_TRIS)    // No such LED
#define OB_LED3      (OB_LED0)

//// Momentary push buttons NOT used on escher Developments
//
//#define BUTTON0_TRIS      (TRISDbits.TRISD6)   // Ref SW1
//#define BUTTON0_IO         (PORTDbits.RD6)
//#define BUTTON1_TRIS      (TRISDbits.TRISD7)   // Ref SW2
//#define BUTTON1_IO         (PORTDbits.RD7)
//#define BUTTON2_TRIS      (TRISDbits.TRISD13)   // Ref SW3
//#define BUTTON2_IO         (PORTDbits.RD13)
//#define BUTTON3_TRIS      (TRISDbits.TRISD13)   // No BUTTON3 on this board
//#define BUTTON3_IO         (1)

//// UART not used on Escher Developments
//// UART configuration (not too important since we don't have a UART
//// connector attached normally, but needed to compile if the STACK_USE_UART
//// or STACK_USE_UART2TCP_BRIDGE features are enabled.
//#define UARTTX_TRIS         (TRISFbits.TRISF3)
//#define UARTRX_TRIS         (TRISFbits.TRISF2)

// Hardware Definitions from maindemo.c for TCP/IP Stack 5.36


// Specify which SPI to use for the ENC28J60 or ENC624J600.  SPI1 is 
// the topmost slot with pin 1 on it.  SPI2 is the middle slot 
// starting on pin 33.
#define ENC_IN_SPI1
//#define ENC_IN_SPI2

// Note that SPI1 cannot be used when using the PIC32 USB Starter 
// Board or PIC32 USB Starter Kit II due to the USB peripheral pins 
// mapping on top of the ordinary SPI1 pinout.  
#if defined(ENC_IN_SPI1) && (defined(__32MX460F512L__) || defined(__32MX795F512L__))
#undef ENC_IN_SPI1
#define ENC_IN_SPI2
#endif


//// ENC28J60 I/O pins
//#if defined ENC_IN_SPI1
//   #define ENC_CS_TRIS         (TRISDbits.TRISD14)
//   #define ENC_CS_IO         (PORTDbits.RD14)
//   //#define ENC_RST_TRIS      (TRISDbits.TRISD15)   // Not connected by default.  It is okay to leave this pin completely unconnected, in which case this macro should simply be left undefined.
//   //#define ENC_RST_IO      (PORTDbits.RD15)
//
//   // SPI SCK, SDI, SDO pins are automatically controlled by the
//   #define ENC_SPI_IF         (IFS0bits.SPI1RXIF)
//   #define ENC_SSPBUF         (SPI1BUF)
//   #define ENC_SPICON1         (SPI1CON)
//   #define ENC_SPICON1bits      (SPI1CONbits)
//   #define ENC_SPIBRG         (SPI1BRG)
//   #define ENC_SPISTATbits      (SPI1STATbits)
//#elif defined ENC_IN_SPI2
//   #define ENC_CS_TRIS         (TRISFbits.TRISF12)
//   #define ENC_CS_IO         (PORTFbits.RF12)
//   //#define ENC_RST_TRIS      (TRISFbits.TRISF13)   // Not connected by default.  It is okay to leave this pin completely unconnected, in which case this macro should simply be left undefined.
//   //#define ENC_RST_IO      (PORTFbits.RF13)
//
//   // SPI SCK, SDI, SDO pins are automatically controlled by the
//   // PIC32 SPI module
//   #define ENC_SPI_IF         (IFS1bits.SPI2RXIF)
//   #define ENC_SSPBUF         (SPI2BUF)
//   #define ENC_SPICON1         (SPI2CON)
//   #define ENC_SPISTATbits      (SPI2STATbits)
//   #define ENC_SPICON1bits      (SPI2CONbits)
//   #define ENC_SPIBRG         (SPI2BRG)
//#endif


// ENC624J600 Interface Configuration
// Comment out ENC100_INTERFACE_MODE if you don't have an ENC624J600 or 
// ENC424J600.  Otherwise, choose the correct setting for the interface you 
// are using.  Legal values are:
//  - Commented out: No ENC424J600/624J600 present or used.  All other 
//                   ENC100_* macros are ignored.
//  - 0: SPI mode using CS, SCK, SI, and SO pins
//  - 1: 8-bit demultiplexed PSP Mode 1 with RD and WR pins
//  - 2: 8-bit demultiplexed PSP Mode 2 with R/Wbar and EN pins
//  - 3: 16-bit demultiplexed PSP Mode 3 with RD, WRL, and WRH pins
//  - 4: 16-bit demultiplexed PSP Mode 4 with R/Wbar, B0SEL, and B1SEL pins
//  - 5: 8-bit multiplexed PSP Mode 5 with RD and WR pins
//  - 6: 8-bit multiplexed PSP Mode 6 with R/Wbar and EN pins
//  - 9: 16-bit multiplexed PSP Mode 9 with AL, RD, WRL, and WRH pins
//  - 10: 16-bit multiplexed PSP Mode 10 with AL, R/Wbar, B0SEL, and B1SEL 
//        pins
#define ENC100_INTERFACE_MODE         5

// If using a parallel interface, direct RAM addressing can be used (if all 
// addresses wires are connected), or a reduced number of pins can be used 
// for indirect addressing.  If using an SPI interface or PSP Mode 9 or 10 
// (multiplexed 16-bit modes), which require all address lines to always be 
// connected, then this option is ignored. Comment out or uncomment this 
// macro to match your hardware connections.
//#define ENC100_PSP_USE_INDIRECT_RAM_ADDRESSING

